# pandas数据读取

In [1]:
import numpy as np
import pandas as pd

In [9]:
#通过read_csv读取csv文件
data = pd.read_csv('data1.csv')
data

    name  age    sex
0    joe   18    men
1  susan   19  women
2   anne   20  women

In [88]:
data2 = pd.read_excel('data2.xlsx')
data2

    name  age    sex
0    joe   18    men
1  susan   19  women
2   anne   20  women

In [89]:
#读取文本、
# data3 = pd.read_csv('data3.txt',sep = ';',header =None)
data3 = pd.read_csv('data3.txt',sep = ';')
data3

    name  age                                                sex
0    joe   18                                                men
1  susan   19                                              women
2   anne   20  women                                         ...

# pandas数据过滤

In [90]:
data3['语文'] = [70,82.5,90]
data3['数学'] = [72,83.5,88]
data3['英语'] = [72,np.NaN,88]

print(data3.columns)
data3

Index(['name', 'age', 'sex', '语文', '数学', '英语'], dtype='object')

,name,age,sex,语文,数学,英语
0,joe,18,men,70.0,72.0,72.0
1,susan,19,women,82.5,83.5,NaN
2,anne,20,women ...,90.0,88.0,88.0

In [93]:
data3 = data3[data3.columns[3:]]
data3

     语文    数学    英语
0  70.0  72.0  72.0
1  82.5  83.5   NaN
2  90.0  88.0  88.0

In [ ]:
缺省值得处理办法

In [94]:
#删除NaN的行
data3 = data3.dropna()
data3

     语文    数学    英语
0  70.0  72.0  72.0
2  90.0  88.0  88.0